{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Q1.5 \n",
    "This query aims to expand the FA-ensemblage gene set based on upstream TF binding site motif patterns."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Data  \n",
    " - FA gene sets  'https://github.com/NCATS-Tangerine/cq-notebooks/tree/master/FA_gene_sets'\n",
    " - motif simalarity datastore 'jaspar.nt'\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "import csv\n",
    "import yaml\n",
    "import requests\n",
    "import json\n",
    "import re"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Untill the hackathon blazegraph instance is available    \n",
    "We are running a local instance [described here](http://localhost:8888/notebooks/LocalBlazeGraph.ipynb)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "bg_host = 'http://localhost:9999'\n",
    "bg = bg_host + '/blazegraph/sparql?format=json&query=' "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "which offers:  \n",
    "\n",
    "    rdf:Description rdf:nodeID=\"service\"\n",
    "        rdf:type \n",
    "            rdf:resource=\"http://www.w3.org/ns/sparql-service-description#Service\"\n",
    "        endpoint \n",
    "            rdf:resource=\"http://localhost:9999/blazegraph/sparql\"\n",
    "        endpoint \n",
    "            rdf:resource=\"http://localhost:9999/bigdata/LBS/sparql\"\n",
    "            \n",
    "Trying the blazegraph/sparql endpoint yields"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{\n",
      "  \"head\" : {\n",
      "    \"vars\" : [ \"g1\" ]\n",
      "  },\n",
      "  \"results\" : {\n",
      "    \"bindings\" : [ {\n",
      "      \"g1\" : {\n",
      "        \"type\" : \"uri\",\n",
      "        \"value\" : \"http://www.ncbi.nlm.nih.gov/gene/6309\"\n",
      "      }\n",
      "    } ]\n",
      "  }\n",
      "}\n"
     ]
    }
   ],
   "source": [
    "x = requests.get(bg + 'SELECT ?g1 WHERE{?g1 <http://purl.obolibrary.org/obo/SO_adjacent_to> ?o} LIMIT 1')\n",
    "print(x.text)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Blazegraph is working localy,   \n",
    "there is a process in place to refresh it when I change the RDF\n",
    "Using the RDF stored in Blazegraph to address the FD TF-binding motif question  \n",
    "in this notebook follows."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "PREFIX RO: <http://purl.obolibrary.org/obo/RO_>\n",
      "PREFIX SO: <http://purl.obolibrary.org/obo/SO_>\n",
      "PREFIX JASPAR: <http://fantom.gsc.riken.jp/5/sstar/JASPAR_motif:>\n",
      "PREFIX OIO: <http://www.geneontology.org/formats/oboInOwl#>\n",
      "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
      "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
      "PREFIX NCBIGene: <http://www.ncbi.nlm.nih.gov/gene/>\n",
      "PREFIX GENO: <http://purl.obolibrary.org/obo/GENO_>\n",
      "PREFIX SWO: <http://www.ebi.ac.uk/efo/swo/SWO_>\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# Want to use existing translation tables when constructing SPARQL queries\n",
    "yamlurl='https://raw.githubusercontent.com/TomConlin/Jaspar_FA/master/translation_tables/curie_map.yaml'\n",
    "rsponse = requests.get(yamlurl)\n",
    "PREFIX = yaml.load(rsponse.text)\n",
    "# print(PREFIX)\n",
    "\n",
    "yamlurl='https://raw.githubusercontent.com/TomConlin/Jaspar_FA/master/translation_tables/translation_table.yaml'\n",
    "rsponse = requests.get(yamlurl)\n",
    "TT = yaml.load(rsponse.text)\n",
    "# print(TT)\n",
    "\n",
    "# redecorate the curie base IRI map \n",
    "# to look like a sparql prefix namespace map  \n",
    "# except the bnode: skolemIRI which is given a java \n",
    "#     \"org.openrdf.query.MalformedQueryException:\n",
    "# for no good reason\n",
    "\n",
    "prefixns = \"\"\n",
    "for p in PREFIX: \n",
    "    if len(p) > 1:\n",
    "       prefixns += 'PREFIX ' + p + ': <' + PREFIX[p] + '>\\n'\n",
    "\n",
    "print(prefixns)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The Fanconi Anemia genes come as symbols/aliases in three sets [here](https://docs.google.com/spreadsheets/d/1yX-5sfrC3vrahf4_k7-5rl4Oqzm853ollIMmUo1PTc0)  \n",
    "I converted them to NCBI gene identifiers and current symbols [here](https://github.com/NCATS-Tangerine/cq-notebooks/tree/master/FA_gene_sets)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "fagene=[]\n",
    "\n",
    "fa1 = '../FA_gene_sets/FA_1_core_complex.txt'\n",
    "core_complex = {}\n",
    "with open(fa1, 'r') as tabfile:\n",
    "    filereader = csv.reader(tabfile, delimiter='\\t')\n",
    "    for row in filereader:   \n",
    "        (fa_gene, fa_symbol) = row\n",
    "        fagene.append(fa_gene)\n",
    "        core_complex[fa_gene]=fa_symbol\n",
    "        \n",
    "fa2 = '../FA_gene_sets/FA_2_effector_proteins.txt'\n",
    "effector_proteins = {}\n",
    "with open(fa2, 'r') as tabfile:\n",
    "    filereader = csv.reader(tabfile, delimiter='\\t')\n",
    "    for row in filereader:   \n",
    "        (fa_gene, fa_symbol) = row\n",
    "        fagene.append(fa_gene)\n",
    "        effector_proteins[fa_gene]=fa_symbol\n",
    "        \n",
    "fa3 = '../FA_gene_sets/FA_3_associated_proteins.txt'\n",
    "associated_proteins = {} \n",
    "with open(fa3, 'r') as tabfile:\n",
    "    filereader = csv.reader(tabfile, delimiter='\\t')\n",
    "    for row in filereader:   \n",
    "        (fa_gene, fa_symbol) = row\n",
    "        fagene.append(fa_gene)\n",
    "        associated_proteins[fa_gene]=fa_symbol"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We can get all the triples patterns available in 'jaspar.nt'   \n",
    "from this [GraphViz dot file](https://github.com/TomConlin/Jaspar_FA/blob/master/jaspar_target_model.gv) since we used it to guide   \n",
    "generating the RDF data in the first place.  \n",
    "\n",
    "![](https://github.com/TomConlin/Jaspar_FA/blob/master/jaspar_target_model.png?raw=true)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "\n",
    "\n",
    "Composing the query by atomizing the GraphViz elements   \n",
    "and selectivly translating with the same tables   \n",
    "the data was generates with means  \n",
    "the SPARQL query remains free of semanticly obsolete clauses.\n",
    "\n",
    "I did this manually, but in general, the rules were roughly:\n",
    "  \n",
    "-    remove angle brackets\n",
    "-    add trailing dot \n",
    "-    replace BNODE: with __?__\n",
    "-    if the element (predicate) is a curie then wrap it in a TT lookup\n",
    "-    if the object is a LITERAL wrap it in quotes\n",
    "-    give the items of intrest specific __?names__\n",
    "-    formating to suit sensibilities"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "In particular we want: \n",
    "    candidate genes which share motif similarity with FA genes\n",
    "    \n",
    "    <NCBIGene:fagene><SO:adjacent_to><BNODE:gene1_upstream_region>\n",
    "    <BNODE:gene1_upstream_region><RO:member of><BNODE:pairwise_similarity>\n",
    "    <BNODE:gene2_upstream_region><RO:member of><BNODE:pairwise_similarity>\n",
    "    <NCBIGene:xyz><SO:adjacent_to><BNODE:gene2_upstream_region> \n",
    "    \n",
    "    when <NCBIGene:xyz> is not <NCBIGene:fagene> \n",
    "    \n",
    "we may also be interested in limiting by region extent size   \n",
    "or Jaccard similarity score\n",
    "\n",
    "    <BNODE:pairwise_similarity><SWO:Similarity score><0.73>\n",
    "    <BNODE:gene1_upstream_region><GENO:has_extent><1k>\n",
    "    \n",
    "    "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Much of the effort to this point has been developing and maintaining a context  \n",
    "in which we are able to __write a readable query__.  \n",
    "\n",
    "Here, given a (fa) gene, we are looking for other genes   \n",
    "with optimal matches (similarity=1) within their 1k start regions."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "PREFIX RO: <http://purl.obolibrary.org/obo/RO_>\n",
      "PREFIX SO: <http://purl.obolibrary.org/obo/SO_>\n",
      "PREFIX JASPAR: <http://fantom.gsc.riken.jp/5/sstar/JASPAR_motif:>\n",
      "PREFIX OIO: <http://www.geneontology.org/formats/oboInOwl#>\n",
      "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
      "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
      "PREFIX NCBIGene: <http://www.ncbi.nlm.nih.gov/gene/>\n",
      "PREFIX GENO: <http://purl.obolibrary.org/obo/GENO_>\n",
      "PREFIX SWO: <http://www.ebi.ac.uk/efo/swo/SWO_>\n",
      "\n",
      "SELECT ?fagene ?candidate\n",
      " WHERE{\n",
      " ?fagene SO:adjacent_to ?gene1_upstream_region .\n",
      " ?gene1_upstream_region RO:0002350 ?pairwise_similarity .\n",
      " ?gene2_upstream_region RO:0002350 ?pairwise_similarity .\n",
      " FILTER(?gene1_upstream_region != ?gene2_upstream_region) \n",
      " ?candidate SO:adjacent_to ?gene2_upstream_region .\n",
      " ?pairwise_similarity SWO:0000425 '1' .\n",
      " ?gene1_upstream_region GENO:0000678 '1k' .\n",
      " FILTER(?fagene != ?candidate)\n",
      "}\n"
     ]
    }
   ],
   "source": [
    "selectstr = ' '.join([\n",
    "    'SELECT ?fagene ?candidate\\n',\n",
    "    'WHERE{\\n',\n",
    "        '?fagene', 'SO:adjacent_to', '?gene1_upstream_region .\\n', \n",
    "        '?gene1_upstream_region',  TT['RO:member of'], '?pairwise_similarity .\\n',\n",
    "        '?gene2_upstream_region',  TT['RO:member of'], '?pairwise_similarity .\\n',\n",
    "        'FILTER(?gene1_upstream_region != ?gene2_upstream_region) \\n', \n",
    "        '?candidate', 'SO:adjacent_to', '?gene2_upstream_region .\\n',\n",
    "        '?pairwise_similarity', TT['SWO:Similarity score'], \"'1' .\\n\", \n",
    "        '?gene1_upstream_region', TT['GENO:has_extent'], \"'1k' .\\n\",\n",
    "    'FILTER(?fagene != ?candidate)\\n}'\n",
    "    ]) \n",
    "\n",
    "# note the abscence of opaque identifiers the query engine actually uses\n",
    "\n",
    "query = prefixns + \"\\n\" + selectstr\n",
    "print(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "UBE2T \t http://www.ncbi.nlm.nih.gov/gene/29089\n",
      "\t http://www.ncbi.nlm.nih.gov/gene/3608\n",
      "\t http://www.ncbi.nlm.nih.gov/gene/171392\n",
      "\t http://www.ncbi.nlm.nih.gov/gene/340252\n",
      "\t http://www.ncbi.nlm.nih.gov/gene/8125\n",
      "\t http://www.ncbi.nlm.nih.gov/gene/54958\n"
     ]
    }
   ],
   "source": [
    "# apply our query to each gene in the FA Core complex\n",
    "candidate_set = {}\n",
    "for fagene in core_complex:\n",
    "    payload = {\n",
    "        'format' : 'json', \n",
    "        # '$fagene':  fagene, \n",
    "        # BG is not accepting the curie. Wants IRI or LITERAL\n",
    "        '$fagene': '<' + re.sub('NCBIGene:',PREFIX['NCBIGene'],fagene) + '>',\n",
    "        'query': query\n",
    "    }\n",
    "    response = requests.post(bg_host + '/blazegraph/sparql', data=payload)\n",
    " \n",
    "    resp = json.loads(response.text)\n",
    "    if resp['results']['bindings'] != []:\n",
    "        print(core_complex[fagene], '\\t', \n",
    "              re.sub('NCBIGene:', PREFIX['NCBIGene'],fagene))\n",
    "        candidate_set[core_complex[fagene]]=[]\n",
    "        for hit in resp['results']['bindings']:\n",
    "            candidate_set[core_complex[fagene]].append(hit['candidate']['value'])\n",
    "            print('\\t', hit['candidate']['value']) "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "UBE2T is the only gene in the Fancomi Anemia core complex  \n",
    "with optimal associations with other genes\n",
    "Briefly those associated genes are:   \n",
    "\n",
    "- ILF2 http://www.ncbi.nlm.nih.gov/gene/3608  \n",
    "    a transcription factor required for T-cell expression of the interleukin 2 gene\n",
    "\n",
    "- ZNF675 https://www.ncbi.nlm.nih.gov/gene/171392  \n",
    "    the novel zinc finger protein TIZ may play a role during osteoclast differentiation by modulating TRAF6 signaling activity.\n",
    "\n",
    "- ZNF680 http://www.ncbi.nlm.nih.gov/gene/340252  \n",
    "    obsevered expressed in thyroid but fairly uncharaterizied\n",
    "\n",
    "- ANP32A http://www.ncbi.nlm.nih.gov/gene/8125  \n",
    "    expressed lymph nodes & bone marrow \n",
    "    The tumor suppressor acidic nuclear phosphoprotein 32 family, member A \n",
    "\n",
    "- TMEM160 http://www.ncbi.nlm.nih.gov/gene/54958  \n",
    "    Not much to see here\n",
    "\n",
    "----\n",
    "Where to go next\n",
    "\n",
    "- We can look for ideal similarity in larger upstream regions but counter intiutivly larger regions average fewer associations because the number of distinct motifs between the larger regions grows faster than the number of motifs the regions will have in common.  (and I dropped any that dipped below the negotiable threshold of one part in five)\n",
    "- We can look for less ideal similarity in the same 1k region \n",
    "- We can look for less ideal similarity in larger regions  \n",
    "\n",
    "For now I am going with looking for less similarity within the same 1k start regions  "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "SELECT ?fagene ?candidate ?score\n",
      " WHERE{\n",
      " ?fagene SO:adjacent_to ?gene1_upstream_region .\n",
      " ?gene1_upstream_region RO:0002350 ?pairwise_similarity .\n",
      " ?gene2_upstream_region RO:0002350 ?pairwise_similarity .\n",
      " FILTER(?gene1_upstream_region != ?gene2_upstream_region) \n",
      " ?candidate SO:adjacent_to ?gene2_upstream_region .\n",
      " ?pairwise_similarity SWO:0000425 ?score .\n",
      " ?gene1_upstream_region GENO:0000678 '1k' .\n",
      " FILTER(?fagene != ?candidate)\n",
      " }\n",
      " ORDER by DESC(?score)\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# small changes to expose the similarity score\n",
    "selectstr = ' '.join([\n",
    "    'SELECT ?fagene ?candidate ?score\\n',\n",
    "    'WHERE{\\n',\n",
    "        '?fagene', 'SO:adjacent_to', '?gene1_upstream_region .\\n', \n",
    "        '?gene1_upstream_region',  TT['RO:member of'], '?pairwise_similarity .\\n',\n",
    "        '?gene2_upstream_region',  TT['RO:member of'], '?pairwise_similarity .\\n',\n",
    "        'FILTER(?gene1_upstream_region != ?gene2_upstream_region) \\n', \n",
    "        '?candidate', 'SO:adjacent_to', '?gene2_upstream_region .\\n',\n",
    "        '?pairwise_similarity', TT['SWO:Similarity score'], '?score .\\n', \n",
    "        '?gene1_upstream_region', TT['GENO:has_extent'], \"'1k' .\\n\",\n",
    "    'FILTER(?fagene != ?candidate)\\n',\n",
    "    #'FILTER(xsd:float(?score) >= 0.5)\\n',\n",
    "    '}\\n',\n",
    "    'ORDER by DESC(?score)\\n'\n",
    "    ])\n",
    "query = prefixns + \"\\n\" + selectstr\n",
    "print(selectstr)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "# apply our query to each gene in the FA Core complex\n",
    "# lowering the association threshold to 1 part in 5 similar \n",
    "# keeping the score for consideration in later processing\n",
    "candidate_core_complex = {}\n",
    "for fagene in core_complex:\n",
    "    payload = {\n",
    "        'format' : 'json', \n",
    "        '$fagene': '<' + re.sub('NCBIGene:',PREFIX['NCBIGene'],fagene) + '>',\n",
    "        'query'  : query\n",
    "    }\n",
    "    response = requests.post(bg_host + '/blazegraph/sparql', data=payload)\n",
    "    # print(response)\n",
    "    resp = json.loads(response.text)\n",
    "    # print(response.text)\n",
    "    \n",
    "    if resp['results']['bindings'] != []:\n",
    "        # print(core_complex[fagene], '\\t', \n",
    "              # re.sub('NCBIGene:', PREFIX['NCBIGene'], fagene))\n",
    "        candidate_core_complex[core_complex[fagene]]={}\n",
    "        for hit in resp['results']['bindings']:\n",
    "            candidate_core_complex[core_complex[fagene]][\n",
    "                hit['candidate']['value']] = hit['score']['value']\n",
    "            # print('\\t', hit['candidate']['value'], hit['score']['value'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "# print(candidate_core_complex)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "# the next FA geneset is effector_proteins\n",
    "candidate_effector_proteins = {}\n",
    "for fagene in effector_proteins:\n",
    "    payload = {\n",
    "        'format' : 'json', \n",
    "        '$fagene': '<' + re.sub('NCBIGene:',PREFIX['NCBIGene'],fagene) + '>',\n",
    "        'query'  : query\n",
    "    }\n",
    "    response = requests.post(bg_host + '/blazegraph/sparql', data=payload)\n",
    "    # print(response)\n",
    "    resp = json.loads(response.text)\n",
    "    # print(response.text)\n",
    "    \n",
    "    if resp['results']['bindings'] != []:\n",
    "        # print(effector_proteins[fagene], '\\t', \n",
    "              # re.sub('NCBIGene:', PREFIX['NCBIGene'],fagene))\n",
    "        candidate_effector_proteins[effector_proteins[fagene]]={}\n",
    "        for hit in resp['results']['bindings']:\n",
    "            candidate_effector_proteins[effector_proteins[fagene]][\n",
    "                    hit['candidate']['value']] = hit['score']['value']\n",
    "            # print('\\t', hit['candidate']['value'], hit['score']['value'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "# and finally associated_proteins\n",
    "candidate_associated_proteins = {}\n",
    "for fagene in associated_proteins:\n",
    "    payload = {\n",
    "        'format' : 'json', \n",
    "        '$fagene': '<' + re.sub('NCBIGene:',PREFIX['NCBIGene'],fagene) + '>',\n",
    "        'query'  : query\n",
    "    }\n",
    "    response = requests.post(bg_host + '/blazegraph/sparql', data=payload)\n",
    "    # print(response)\n",
    "    resp = json.loads(response.text)\n",
    "    # print(response.text)\n",
    "    \n",
    "    if resp['results']['bindings'] != []:\n",
    "        # print(associated_proteins[fagene], '\\t', \n",
    "              # re.sub('NCBIGene:', PREFIX['NCBIGene'],fagene))\n",
    "        candidate_associated_proteins[associated_proteins[fagene]]={}\n",
    "        for hit in resp['results']['bindings']:\n",
    "            candidate_associated_proteins[\n",
    "                associated_proteins[fagene]][\n",
    "                   hit['candidate']['value']] = hit['score']['value']\n",
    "            # print('\\t', hit['candidate']['value'], hit['score']['value'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Researchers would like to see gene symbols. \n",
    "# Here we are calling HGNC for only the freshest in gene fashion wear.\n",
    "# http://rest.genenames.org/search/entrez_id/673\n",
    "def entrez_symbol(ncbigene_uri):\n",
    "    api_uri = re.sub(\n",
    "        'http://www.ncbi.nlm.nih.gov/gene/',\n",
    "        'http://rest.genenames.org/search/entrez_id/', ncbigene_uri)\n",
    "    response = requests.get(api_uri, headers={'Accept': 'application/json'})\n",
    "    if str(response) == '<Response [200]>':\n",
    "        hgnc = json.loads(response.text)\n",
    "        if hgnc['response']['numFound'] > 0:\n",
    "            symbol = hgnc['response']['docs'][0]['symbol']\n",
    "        else:\n",
    "            symbol = \"\"  # none found    \n",
    "    else: # it will be ugly so someone will notice\n",
    "        symbol = 'ERROR ' + api_uri + ' ' + str(response)\n",
    "    return symbol"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "    # quick tests\n",
    "    entrez_symbol('http://www.ncbi.nlm.nih.gov/gene/672')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "    entrez_symbol('http://www.ncbi.nlm.nih.gov/gene/-1')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "candidate_effector_proteins set has (4) genes with hits\n",
      "   SLX4 (67) associations\n",
      "EIF3E \t http://www.ncbi.nlm.nih.gov/gene/3646 0.25\n",
      "AREL1 \t http://www.ncbi.nlm.nih.gov/gene/9870 0.25\n",
      "WDR46 \t http://www.ncbi.nlm.nih.gov/gene/9277 0.2\n",
      "ZNF329 \t http://www.ncbi.nlm.nih.gov/gene/79673 0.2\n",
      "MEA1 \t http://www.ncbi.nlm.nih.gov/gene/4201 0.2\n",
      "N6AMT1 \t http://www.ncbi.nlm.nih.gov/gene/29104 0.25\n",
      "MIS18A \t http://www.ncbi.nlm.nih.gov/gene/54069 0.2\n",
      "HEATR5B \t http://www.ncbi.nlm.nih.gov/gene/54497 0.2\n",
      "IKZF2 \t http://www.ncbi.nlm.nih.gov/gene/22807 0.25\n",
      "PTGES3L \t http://www.ncbi.nlm.nih.gov/gene/100885848 0.25\n",
      "SUGP2 \t http://www.ncbi.nlm.nih.gov/gene/10147 0.2\n",
      "PSPC1 \t http://www.ncbi.nlm.nih.gov/gene/55269 0.25\n",
      "TMEM161B \t http://www.ncbi.nlm.nih.gov/gene/153396 0.2\n",
      "RAB14 \t http://www.ncbi.nlm.nih.gov/gene/51552 0.25\n",
      "CCDC127 \t http://www.ncbi.nlm.nih.gov/gene/133957 0.25\n",
      "RBFOX2 \t http://www.ncbi.nlm.nih.gov/gene/23543 0.25\n",
      "SOS2 \t http://www.ncbi.nlm.nih.gov/gene/6655 0.2\n",
      "SMG6 \t http://www.ncbi.nlm.nih.gov/gene/23293 0.25\n",
      "NPRL3 \t http://www.ncbi.nlm.nih.gov/gene/8131 0.25\n",
      "MEIS2 \t http://www.ncbi.nlm.nih.gov/gene/4212 0.2\n",
      "DHRS13 \t http://www.ncbi.nlm.nih.gov/gene/147015 0.2\n",
      "TOLLIP \t http://www.ncbi.nlm.nih.gov/gene/54472 0.2\n",
      "SAYSD1 \t http://www.ncbi.nlm.nih.gov/gene/55776 0.2\n",
      "EEF1D \t http://www.ncbi.nlm.nih.gov/gene/1936 0.2\n",
      "UNKL \t http://www.ncbi.nlm.nih.gov/gene/64718 0.2\n",
      "VPS13C \t http://www.ncbi.nlm.nih.gov/gene/54832 0.2\n",
      "FBXW5 \t http://www.ncbi.nlm.nih.gov/gene/54461 0.2\n",
      "RAB35 \t http://www.ncbi.nlm.nih.gov/gene/11021 0.25\n",
      "FAM227A \t http://www.ncbi.nlm.nih.gov/gene/646851 0.25\n",
      "EIF3G \t http://www.ncbi.nlm.nih.gov/gene/8666 0.25\n",
      "STRADA \t http://www.ncbi.nlm.nih.gov/gene/92335 0.2\n",
      "STK32C \t http://www.ncbi.nlm.nih.gov/gene/282974 0.2\n",
      "RNF19A \t http://www.ncbi.nlm.nih.gov/gene/25897 0.25\n",
      "DENND6A \t http://www.ncbi.nlm.nih.gov/gene/201627 0.2\n",
      "POU4F1 \t http://www.ncbi.nlm.nih.gov/gene/5457 0.25\n",
      "MAD1L1 \t http://www.ncbi.nlm.nih.gov/gene/8379 0.25\n",
      "NARFL \t http://www.ncbi.nlm.nih.gov/gene/64428 0.2\n",
      "FAM58A \t http://www.ncbi.nlm.nih.gov/gene/92002 0.2\n",
      "ZBTB17 \t http://www.ncbi.nlm.nih.gov/gene/7709 0.25\n",
      "NOB1 \t http://www.ncbi.nlm.nih.gov/gene/28987 0.25\n",
      "MRPS33 \t http://www.ncbi.nlm.nih.gov/gene/51650 0.2\n",
      "MBD1 \t http://www.ncbi.nlm.nih.gov/gene/4152 0.25\n",
      "CDCA3 \t http://www.ncbi.nlm.nih.gov/gene/83461 0.2\n",
      "BNIP3 \t http://www.ncbi.nlm.nih.gov/gene/664 0.2\n",
      "TMEM203 \t http://www.ncbi.nlm.nih.gov/gene/94107 0.2\n",
      "MPHOSPH6 \t http://www.ncbi.nlm.nih.gov/gene/10200 0.2\n",
      "TXNDC9 \t http://www.ncbi.nlm.nih.gov/gene/10190 0.25\n",
      "UNC93B1 \t http://www.ncbi.nlm.nih.gov/gene/81622 0.25\n",
      "TMEM184B \t http://www.ncbi.nlm.nih.gov/gene/25829 0.25\n",
      "ASCC1 \t http://www.ncbi.nlm.nih.gov/gene/51008 0.2\n",
      "ZNF287 \t http://www.ncbi.nlm.nih.gov/gene/57336 0.25\n",
      "ARHGEF39 \t http://www.ncbi.nlm.nih.gov/gene/84904 0.25\n",
      "ZC3H8 \t http://www.ncbi.nlm.nih.gov/gene/84524 0.25\n",
      "C10orf111 \t http://www.ncbi.nlm.nih.gov/gene/221060 0.2\n",
      "CCDC93 \t http://www.ncbi.nlm.nih.gov/gene/54520 0.2\n",
      "PRKAR2A \t http://www.ncbi.nlm.nih.gov/gene/5576 0.25\n",
      "PRELID3B \t http://www.ncbi.nlm.nih.gov/gene/51012 0.2\n",
      "EID2B \t http://www.ncbi.nlm.nih.gov/gene/126272 0.25\n",
      "CCDC96 \t http://www.ncbi.nlm.nih.gov/gene/257236 0.2\n",
      "C10orf88 \t http://www.ncbi.nlm.nih.gov/gene/80007 0.25\n",
      "HIRIP3 \t http://www.ncbi.nlm.nih.gov/gene/8479 0.25\n",
      "SIRT6 \t http://www.ncbi.nlm.nih.gov/gene/51548 0.25\n",
      "SDHB \t http://www.ncbi.nlm.nih.gov/gene/6390 0.2\n",
      "UBE2V1 \t http://www.ncbi.nlm.nih.gov/gene/7335 0.25\n",
      "PPM1F \t http://www.ncbi.nlm.nih.gov/gene/9647 0.25\n",
      "TWF2 \t http://www.ncbi.nlm.nih.gov/gene/11344 0.2\n",
      "CXorf38 \t http://www.ncbi.nlm.nih.gov/gene/159013 0.2\n",
      "   PALB2 (21) associations\n",
      "C16orf46 \t http://www.ncbi.nlm.nih.gov/gene/123775 0.333333\n",
      "LRRC47 \t http://www.ncbi.nlm.nih.gov/gene/57470 0.25\n",
      "MCAT \t http://www.ncbi.nlm.nih.gov/gene/27349 0.2\n",
      "RGL2 \t http://www.ncbi.nlm.nih.gov/gene/5863 0.2\n",
      "C2orf68 \t http://www.ncbi.nlm.nih.gov/gene/388969 0.25\n",
      "FAAP100 \t http://www.ncbi.nlm.nih.gov/gene/80233 0.25\n",
      "LYSMD1 \t http://www.ncbi.nlm.nih.gov/gene/388695 0.25\n",
      "OTUD7B \t http://www.ncbi.nlm.nih.gov/gene/56957 0.2\n",
      "PGAP3 \t http://www.ncbi.nlm.nih.gov/gene/93210 0.333333\n",
      "WDR27 \t http://www.ncbi.nlm.nih.gov/gene/253769 0.2\n",
      "TMEM230 \t http://www.ncbi.nlm.nih.gov/gene/29058 0.2\n",
      "PPID \t http://www.ncbi.nlm.nih.gov/gene/5481 0.25\n",
      "ZNF384 \t http://www.ncbi.nlm.nih.gov/gene/171017 0.2\n",
      "MUT \t http://www.ncbi.nlm.nih.gov/gene/4594 0.25\n",
      "KIAA0825 \t http://www.ncbi.nlm.nih.gov/gene/285600 0.2\n",
      "NTHL1 \t http://www.ncbi.nlm.nih.gov/gene/4913 0.25\n",
      "EMC7 \t http://www.ncbi.nlm.nih.gov/gene/56851 0.2\n",
      "FBXW2 \t http://www.ncbi.nlm.nih.gov/gene/26190 0.25\n",
      "LRRC41 \t http://www.ncbi.nlm.nih.gov/gene/10489 0.2\n",
      "DPM3 \t http://www.ncbi.nlm.nih.gov/gene/54344 0.25\n",
      "FBXW9 \t http://www.ncbi.nlm.nih.gov/gene/84261 0.333333\n",
      "   XRCC2 (9) associations\n",
      "ZNF347 \t http://www.ncbi.nlm.nih.gov/gene/84671 0.25\n",
      "SMC1A \t http://www.ncbi.nlm.nih.gov/gene/8243 0.25\n",
      "PRKN \t http://www.ncbi.nlm.nih.gov/gene/5071 0.2\n",
      "ATP5G3 \t http://www.ncbi.nlm.nih.gov/gene/518 0.2\n",
      "RNF122 \t http://www.ncbi.nlm.nih.gov/gene/79845 0.2\n",
      "PEX11A \t http://www.ncbi.nlm.nih.gov/gene/8800 0.333333\n",
      "PDRG1 \t http://www.ncbi.nlm.nih.gov/gene/81572 0.333333\n",
      "MAGI1 \t http://www.ncbi.nlm.nih.gov/gene/9223 0.2\n",
      "COPS2 \t http://www.ncbi.nlm.nih.gov/gene/9318 0.333333\n",
      "   BRIP1 (7) associations\n",
      "LMBR1L \t http://www.ncbi.nlm.nih.gov/gene/55716 0.333333\n",
      "ATP5E \t http://www.ncbi.nlm.nih.gov/gene/514 0.2\n",
      "ISOC2 \t http://www.ncbi.nlm.nih.gov/gene/79763 0.2\n",
      "ABL2 \t http://www.ncbi.nlm.nih.gov/gene/27 1\n",
      "TMEM53 \t http://www.ncbi.nlm.nih.gov/gene/79639 0.5\n",
      "GOLGB1 \t http://www.ncbi.nlm.nih.gov/gene/2804 0.25\n",
      " \t http://www.ncbi.nlm.nih.gov/gene/109504726 1\n",
      "candidate_associated_proteins set has (3) genes with hits\n",
      "   CENPX (31) associations\n",
      "IARS \t http://www.ncbi.nlm.nih.gov/gene/3376 0.2\n",
      "TBCCD1 \t http://www.ncbi.nlm.nih.gov/gene/55171 0.2\n",
      "EPHB4 \t http://www.ncbi.nlm.nih.gov/gene/2050 0.2\n",
      "FMN1 \t http://www.ncbi.nlm.nih.gov/gene/342184 0.2\n",
      "CYB5RL \t http://www.ncbi.nlm.nih.gov/gene/606495 0.2\n",
      "HYI \t http://www.ncbi.nlm.nih.gov/gene/81888 0.2\n",
      "ROGDI \t http://www.ncbi.nlm.nih.gov/gene/79641 0.2\n",
      "FUCA1 \t http://www.ncbi.nlm.nih.gov/gene/2517 0.2\n",
      "FKBP3 \t http://www.ncbi.nlm.nih.gov/gene/2287 0.2\n",
      "KLHL25 \t http://www.ncbi.nlm.nih.gov/gene/64410 0.2\n",
      "NUP43 \t http://www.ncbi.nlm.nih.gov/gene/348995 0.2\n",
      "DHX57 \t http://www.ncbi.nlm.nih.gov/gene/90957 0.2\n",
      "RBM23 \t http://www.ncbi.nlm.nih.gov/gene/55147 0.2\n",
      "PDK4 \t http://www.ncbi.nlm.nih.gov/gene/5166 0.2\n",
      "ZNF550 \t http://www.ncbi.nlm.nih.gov/gene/162972 0.2\n",
      "CCDC153 \t http://www.ncbi.nlm.nih.gov/gene/283152 0.2\n",
      "LZIC \t http://www.ncbi.nlm.nih.gov/gene/84328 0.2\n",
      "PPIL1 \t http://www.ncbi.nlm.nih.gov/gene/51645 0.2\n",
      "RRN3 \t http://www.ncbi.nlm.nih.gov/gene/54700 0.2\n",
      "C16orf87 \t http://www.ncbi.nlm.nih.gov/gene/388272 0.2\n",
      "PGK2 \t http://www.ncbi.nlm.nih.gov/gene/5232 0.2\n",
      "HLA-DMA \t http://www.ncbi.nlm.nih.gov/gene/3108 0.2\n",
      "RABL3 \t http://www.ncbi.nlm.nih.gov/gene/285282 0.2\n",
      "VPS52 \t http://www.ncbi.nlm.nih.gov/gene/6293 0.2\n",
      "CYP39A1 \t http://www.ncbi.nlm.nih.gov/gene/51302 0.2\n",
      "ZFAT \t http://www.ncbi.nlm.nih.gov/gene/57623 0.2\n",
      "RTBDN \t http://www.ncbi.nlm.nih.gov/gene/83546 0.2\n",
      "XRN1 \t http://www.ncbi.nlm.nih.gov/gene/54464 0.2\n",
      "ZNF20 \t http://www.ncbi.nlm.nih.gov/gene/7568 0.2\n",
      "SLC26A6 \t http://www.ncbi.nlm.nih.gov/gene/65010 0.2\n",
      "ALDH4A1 \t http://www.ncbi.nlm.nih.gov/gene/8659 0.2\n",
      "   FAAP100 (30) associations\n",
      "C16orf46 \t http://www.ncbi.nlm.nih.gov/gene/123775 0.5\n",
      "WDR27 \t http://www.ncbi.nlm.nih.gov/gene/253769 0.25\n",
      "NTHL1 \t http://www.ncbi.nlm.nih.gov/gene/4913 0.333333\n",
      "PGAP3 \t http://www.ncbi.nlm.nih.gov/gene/93210 0.5\n",
      "OTUD7B \t http://www.ncbi.nlm.nih.gov/gene/56957 0.25\n",
      "SF3B6 \t http://www.ncbi.nlm.nih.gov/gene/51639 0.2\n",
      "STAU1 \t http://www.ncbi.nlm.nih.gov/gene/6780 0.2\n",
      "CYB561A3 \t http://www.ncbi.nlm.nih.gov/gene/220002 0.2\n",
      "TMEM230 \t http://www.ncbi.nlm.nih.gov/gene/29058 0.25\n",
      "PPID \t http://www.ncbi.nlm.nih.gov/gene/5481 0.333333\n",
      "ZNF384 \t http://www.ncbi.nlm.nih.gov/gene/171017 0.25\n",
      "MUT \t http://www.ncbi.nlm.nih.gov/gene/4594 0.333333\n",
      "TAF12 \t http://www.ncbi.nlm.nih.gov/gene/6883 0.2\n",
      "LRRC41 \t http://www.ncbi.nlm.nih.gov/gene/10489 0.333333\n",
      "DPM3 \t http://www.ncbi.nlm.nih.gov/gene/54344 0.333333\n",
      "LYSMD1 \t http://www.ncbi.nlm.nih.gov/gene/388695 0.333333\n",
      "LRRC47 \t http://www.ncbi.nlm.nih.gov/gene/57470 0.333333\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "RGL2 \t http://www.ncbi.nlm.nih.gov/gene/5863 0.25\n",
      "FBXW2 \t http://www.ncbi.nlm.nih.gov/gene/26190 0.333333\n",
      "MED19 \t http://www.ncbi.nlm.nih.gov/gene/219541 0.2\n",
      "C7orf49 \t http://www.ncbi.nlm.nih.gov/gene/78996 0.2\n",
      "PALB2 \t http://www.ncbi.nlm.nih.gov/gene/79728 0.25\n",
      "KIAA0825 \t http://www.ncbi.nlm.nih.gov/gene/285600 0.25\n",
      "RPS6 \t http://www.ncbi.nlm.nih.gov/gene/6194 0.2\n",
      "C2orf68 \t http://www.ncbi.nlm.nih.gov/gene/388969 0.333333\n",
      "EMC7 \t http://www.ncbi.nlm.nih.gov/gene/56851 0.25\n",
      "MCAT \t http://www.ncbi.nlm.nih.gov/gene/27349 0.25\n",
      "CAGE1 \t http://www.ncbi.nlm.nih.gov/gene/285782 0.2\n",
      "KNOP1 \t http://www.ncbi.nlm.nih.gov/gene/400506 0.2\n",
      "FBXW9 \t http://www.ncbi.nlm.nih.gov/gene/84261 0.5\n",
      "   FAAP20 (30) associations\n",
      "MYO1A \t http://www.ncbi.nlm.nih.gov/gene/4640 0.25\n",
      "ANKRD18A \t http://www.ncbi.nlm.nih.gov/gene/253650 0.5\n",
      "C8orf59 \t http://www.ncbi.nlm.nih.gov/gene/401466 0.2\n",
      "ZNF414 \t http://www.ncbi.nlm.nih.gov/gene/84330 0.25\n",
      "CEACAM1 \t http://www.ncbi.nlm.nih.gov/gene/634 0.25\n",
      "DBNDD1 \t http://www.ncbi.nlm.nih.gov/gene/79007 0.25\n",
      "MIF4GD \t http://www.ncbi.nlm.nih.gov/gene/57409 0.2\n",
      "BCAT2 \t http://www.ncbi.nlm.nih.gov/gene/587 0.333333\n",
      "ANXA2 \t http://www.ncbi.nlm.nih.gov/gene/302 0.2\n",
      "SP6 \t http://www.ncbi.nlm.nih.gov/gene/80320 0.2\n",
      "PTGIR \t http://www.ncbi.nlm.nih.gov/gene/5739 0.25\n",
      "GPR20 \t http://www.ncbi.nlm.nih.gov/gene/2843 0.5\n",
      "LHB \t http://www.ncbi.nlm.nih.gov/gene/3972 0.2\n",
      "RPS27L \t http://www.ncbi.nlm.nih.gov/gene/51065 0.333333\n",
      "PRTFDC1 \t http://www.ncbi.nlm.nih.gov/gene/56952 0.25\n",
      "MATN3 \t http://www.ncbi.nlm.nih.gov/gene/4148 0.5\n",
      "AMT \t http://www.ncbi.nlm.nih.gov/gene/275 0.25\n",
      "UNKL \t http://www.ncbi.nlm.nih.gov/gene/64718 0.333333\n",
      "MYH7 \t http://www.ncbi.nlm.nih.gov/gene/4625 0.25\n",
      "BEGAIN \t http://www.ncbi.nlm.nih.gov/gene/57596 0.25\n",
      "CHST15 \t http://www.ncbi.nlm.nih.gov/gene/51363 0.5\n",
      "SFRP5 \t http://www.ncbi.nlm.nih.gov/gene/6425 0.25\n",
      "KIAA0895L \t http://www.ncbi.nlm.nih.gov/gene/653319 0.333333\n",
      "NAA10 \t http://www.ncbi.nlm.nih.gov/gene/8260 0.333333\n",
      "HSD17B11 \t http://www.ncbi.nlm.nih.gov/gene/51170 0.25\n",
      "ZSCAN10 \t http://www.ncbi.nlm.nih.gov/gene/84891 0.25\n",
      "C16orf47 \t http://www.ncbi.nlm.nih.gov/gene/388289 0.25\n",
      "CD70 \t http://www.ncbi.nlm.nih.gov/gene/970 0.25\n",
      "AGMO \t http://www.ncbi.nlm.nih.gov/gene/392636 0.25\n",
      "VWCE \t http://www.ncbi.nlm.nih.gov/gene/220001 0.25\n",
      "candidate_core_complex set has (5) genes with hits\n",
      "   UBE2T (28) associations\n",
      "PDIA6 \t http://www.ncbi.nlm.nih.gov/gene/10130 0.5\n",
      "ZNF77 \t http://www.ncbi.nlm.nih.gov/gene/58492 0.25\n",
      "ZNF680 \t http://www.ncbi.nlm.nih.gov/gene/340252 1\n",
      "ANP32A \t http://www.ncbi.nlm.nih.gov/gene/8125 1\n",
      "KANSL2 \t http://www.ncbi.nlm.nih.gov/gene/54934 0.25\n",
      "RHOF \t http://www.ncbi.nlm.nih.gov/gene/54509 0.333333\n",
      "CFAP43 \t http://www.ncbi.nlm.nih.gov/gene/80217 0.5\n",
      "SLC43A2 \t http://www.ncbi.nlm.nih.gov/gene/124935 0.25\n",
      "MPP7 \t http://www.ncbi.nlm.nih.gov/gene/143098 0.333333\n",
      "GOLGB1 \t http://www.ncbi.nlm.nih.gov/gene/2804 0.25\n",
      "CKB \t http://www.ncbi.nlm.nih.gov/gene/1152 0.5\n",
      "BUB1 \t http://www.ncbi.nlm.nih.gov/gene/699 0.2\n",
      "CDR2 \t http://www.ncbi.nlm.nih.gov/gene/1039 0.5\n",
      "DHCR24 \t http://www.ncbi.nlm.nih.gov/gene/1718 0.5\n",
      "ULK4 \t http://www.ncbi.nlm.nih.gov/gene/54986 0.5\n",
      "ANKRD9 \t http://www.ncbi.nlm.nih.gov/gene/122416 0.25\n",
      "MRPL51 \t http://www.ncbi.nlm.nih.gov/gene/51258 0.2\n",
      "ATG2A \t http://www.ncbi.nlm.nih.gov/gene/23130 0.333333\n",
      "ZNF675 \t http://www.ncbi.nlm.nih.gov/gene/171392 1\n",
      "DEDD2 \t http://www.ncbi.nlm.nih.gov/gene/162989 0.25\n",
      "C12orf76 \t http://www.ncbi.nlm.nih.gov/gene/400073 0.2\n",
      "ILF2 \t http://www.ncbi.nlm.nih.gov/gene/3608 1\n",
      "TFDP2 \t http://www.ncbi.nlm.nih.gov/gene/7029 0.25\n",
      "TYSND1 \t http://www.ncbi.nlm.nih.gov/gene/219743 0.5\n",
      "TMEM160 \t http://www.ncbi.nlm.nih.gov/gene/54958 1\n",
      "ALS2CR12 \t http://www.ncbi.nlm.nih.gov/gene/130540 0.333333\n",
      "CCDC148 \t http://www.ncbi.nlm.nih.gov/gene/130940 0.2\n",
      "TECPR1 \t http://www.ncbi.nlm.nih.gov/gene/25851 0.333333\n",
      "   FANCA (36) associations\n",
      "IARS \t http://www.ncbi.nlm.nih.gov/gene/3376 0.2\n",
      "TBCCD1 \t http://www.ncbi.nlm.nih.gov/gene/55171 0.25\n",
      "CCDC191 \t http://www.ncbi.nlm.nih.gov/gene/57577 0.2\n",
      "TMEM161A \t http://www.ncbi.nlm.nih.gov/gene/54929 0.2\n",
      "LRRC24 \t http://www.ncbi.nlm.nih.gov/gene/441381 0.25\n",
      "CYB5RL \t http://www.ncbi.nlm.nih.gov/gene/606495 0.25\n",
      "AIFM1 \t http://www.ncbi.nlm.nih.gov/gene/9131 0.2\n",
      "HYI \t http://www.ncbi.nlm.nih.gov/gene/81888 0.25\n",
      "NDUFAB1 \t http://www.ncbi.nlm.nih.gov/gene/4706 0.25\n",
      "TTLL6 \t http://www.ncbi.nlm.nih.gov/gene/284076 0.2\n",
      "SLC16A1 \t http://www.ncbi.nlm.nih.gov/gene/6566 0.2\n",
      "LIG4 \t http://www.ncbi.nlm.nih.gov/gene/3981 0.2\n",
      "NUP43 \t http://www.ncbi.nlm.nih.gov/gene/348995 0.25\n",
      "ROCK1 \t http://www.ncbi.nlm.nih.gov/gene/6093 0.25\n",
      "STMN4 \t http://www.ncbi.nlm.nih.gov/gene/81551 0.2\n",
      "ZNF20 \t http://www.ncbi.nlm.nih.gov/gene/7568 0.25\n",
      "PAXIP1 \t http://www.ncbi.nlm.nih.gov/gene/22976 0.25\n",
      "PPIL1 \t http://www.ncbi.nlm.nih.gov/gene/51645 0.25\n",
      "KDM5C \t http://www.ncbi.nlm.nih.gov/gene/8242 0.2\n",
      "C3orf18 \t http://www.ncbi.nlm.nih.gov/gene/51161 0.2\n",
      "CLCC1 \t http://www.ncbi.nlm.nih.gov/gene/23155 0.2\n",
      "RBM23 \t http://www.ncbi.nlm.nih.gov/gene/55147 0.2\n",
      "PGK2 \t http://www.ncbi.nlm.nih.gov/gene/5232 0.25\n",
      "IL17RD \t http://www.ncbi.nlm.nih.gov/gene/54756 0.25\n",
      "SMARCD3 \t http://www.ncbi.nlm.nih.gov/gene/6604 0.25\n",
      "ATAD2 \t http://www.ncbi.nlm.nih.gov/gene/29028 0.2\n",
      "KIF14 \t http://www.ncbi.nlm.nih.gov/gene/9928 0.2\n",
      "SPTLC2 \t http://www.ncbi.nlm.nih.gov/gene/9517 0.2\n",
      "ZFAT \t http://www.ncbi.nlm.nih.gov/gene/57623 0.2\n",
      "ALDH4A1 \t http://www.ncbi.nlm.nih.gov/gene/8659 0.25\n",
      "PDK4 \t http://www.ncbi.nlm.nih.gov/gene/5166 0.25\n",
      "GANAB \t http://www.ncbi.nlm.nih.gov/gene/23193 0.2\n",
      "EBPL \t http://www.ncbi.nlm.nih.gov/gene/84650 0.2\n",
      "NUP62CL \t http://www.ncbi.nlm.nih.gov/gene/54830 0.2\n",
      "BORCS6 \t http://www.ncbi.nlm.nih.gov/gene/54785 0.2\n",
      "DHX57 \t http://www.ncbi.nlm.nih.gov/gene/90957 0.25\n",
      "   FANCL (7) associations\n",
      "TTC33 \t http://www.ncbi.nlm.nih.gov/gene/23548 0.2\n",
      "STAG1 \t http://www.ncbi.nlm.nih.gov/gene/10274 0.2\n",
      "TRIM33 \t http://www.ncbi.nlm.nih.gov/gene/51592 0.2\n",
      "CSTF2T \t http://www.ncbi.nlm.nih.gov/gene/23283 0.25\n",
      "MED14 \t http://www.ncbi.nlm.nih.gov/gene/9282 0.25\n",
      "IGF2BP2 \t http://www.ncbi.nlm.nih.gov/gene/10644 0.333333\n",
      "SEPHS1 \t http://www.ncbi.nlm.nih.gov/gene/22929 0.2\n",
      "   FANCC (21) associations\n",
      "WWTR1 \t http://www.ncbi.nlm.nih.gov/gene/25937 0.25\n",
      "TGFBR3 \t http://www.ncbi.nlm.nih.gov/gene/7049 0.25\n",
      "ALX3 \t http://www.ncbi.nlm.nih.gov/gene/257 0.25\n",
      "CD163L1 \t http://www.ncbi.nlm.nih.gov/gene/283316 0.25\n",
      "C1orf198 \t http://www.ncbi.nlm.nih.gov/gene/84886 0.2\n",
      "SLC7A8 \t http://www.ncbi.nlm.nih.gov/gene/23428 0.25\n",
      "MAPK10 \t http://www.ncbi.nlm.nih.gov/gene/5602 0.25\n",
      "ANXA11 \t http://www.ncbi.nlm.nih.gov/gene/311 0.25\n",
      "DDAH1 \t http://www.ncbi.nlm.nih.gov/gene/23576 0.2\n",
      "PLAGL1 \t http://www.ncbi.nlm.nih.gov/gene/5325 0.25\n",
      "KRT39 \t http://www.ncbi.nlm.nih.gov/gene/390792 0.25\n",
      "GSTA1 \t http://www.ncbi.nlm.nih.gov/gene/2938 0.25\n",
      "FCRL4 \t http://www.ncbi.nlm.nih.gov/gene/83417 0.25\n",
      "GSTA2 \t http://www.ncbi.nlm.nih.gov/gene/2939 0.2\n",
      "SMC1B \t http://www.ncbi.nlm.nih.gov/gene/27127 0.2\n",
      "TKTL2 \t http://www.ncbi.nlm.nih.gov/gene/84076 0.25\n",
      "NPHS1 \t http://www.ncbi.nlm.nih.gov/gene/4868 0.25\n",
      "PCYT1B \t http://www.ncbi.nlm.nih.gov/gene/9468 0.25\n",
      "AMELY \t http://www.ncbi.nlm.nih.gov/gene/266 0.25\n",
      "PEG3 \t http://www.ncbi.nlm.nih.gov/gene/5178 0.25\n",
      "TOMM5 \t http://www.ncbi.nlm.nih.gov/gene/401505 0.25\n",
      "   FANCB (13) associations\n",
      "RBM39 \t http://www.ncbi.nlm.nih.gov/gene/9584 0.25\n",
      "RHBDF2 \t http://www.ncbi.nlm.nih.gov/gene/79651 0.25\n",
      "SEMA6A \t http://www.ncbi.nlm.nih.gov/gene/57556 0.333333\n",
      "GPR157 \t http://www.ncbi.nlm.nih.gov/gene/80045 0.333333\n",
      "LARGE1 \t http://www.ncbi.nlm.nih.gov/gene/9215 0.333333\n",
      "GPAM \t http://www.ncbi.nlm.nih.gov/gene/57678 0.333333\n",
      "FYCO1 \t http://www.ncbi.nlm.nih.gov/gene/79443 0.333333\n",
      "TMEM134 \t http://www.ncbi.nlm.nih.gov/gene/80194 0.333333\n",
      "KCNJ10 \t http://www.ncbi.nlm.nih.gov/gene/3766 0.333333\n",
      "PLXND1 \t http://www.ncbi.nlm.nih.gov/gene/23129 0.333333\n",
      "GGT7 \t http://www.ncbi.nlm.nih.gov/gene/2686 0.333333\n",
      "SLC35E2 \t http://www.ncbi.nlm.nih.gov/gene/9906 0.333333\n",
      "RNF126 \t http://www.ncbi.nlm.nih.gov/gene/55658 0.25\n"
     ]
    }
   ],
   "source": [
    "# what have we got in the candidate sets?\n",
    "\n",
    "# homoiconic coders, avert your eyes\n",
    "fa_sets={\n",
    "    'candidate_core_complex' : candidate_core_complex,\n",
    "    'candidate_effector_proteins' : candidate_effector_proteins,\n",
    "    'candidate_associated_proteins' : candidate_associated_proteins\n",
    "}\n",
    "# keep a stash of gene symbols\n",
    "ncbigene_symbol = {}\n",
    "\n",
    "for fas in fa_sets:\n",
    "    print(fas +' set has', '(' + str(len(fa_sets[fas])) +') genes with hits')\n",
    "    for fa in fa_sets[fas]:\n",
    "        print('  ', fa, '(' + str(len(fa_sets[fas][fa])) +') associations')\n",
    "        hits = []\n",
    "        for c in fa_sets[fas][fa]:\n",
    "            # try to be nice to our friends at HGNC\n",
    "            if c not in ncbigene_symbol:\n",
    "                ncbigene_symbol[c] = entrez_symbol(c)\n",
    "            symbol = ncbigene_symbol[c]\n",
    "            #print(symbol,'\\t', c, fa_sets[fas][fa][c])\n",
    "            hits.append([fa_sets[fas][fa][c], symbol, c])\n",
    "        # reorder the set  \n",
    "        hits.sort()\n",
    "        # output the set"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "well they went in ordered by score... "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.5.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
